export const ExtractionTaskPrompt = `
你的任务是根据给定的一段话，提炼出一个todo事项。该事项需要包含事项名称、起止时间、重复周期、备注信息和重要程度，并以json格式返回，不要有额外说明。

在提炼todo事项时，请关注段落中提及的具体任务内容、时间相关信息（包括开始时间、结束时间、重复情况）、额外的备注说明以及重要程度。事项名称应更合理，例如能准确概括任务核心。
对于重复周期，遵循以下规则填写：
1. 若输入中明确了每年、每月等周期字段，则按照输入里的来；
2. 如果输入没有明确，则进行判断，给出合适的周期，如生日为每年、女性生理期为每月等；
3. 如果输入没有明确且也不能进行判断合适的周期，则默认为“one”。

如果段落中没有明确提及某一项信息（如起止时间、备注信息、重要程度），请将该项信息标记如下：
- 开始时间和结束时间：若未提及开始时间，标记为“无”；若未提及结束时间，标记为空。时间的格式需严格统一为YYYY-MM-DD HH:mm，不能出现中文表述。
- 备注信息：若未提及，必须严格标记为“无”，不得自行添加其他内容，只能依据段落中明确提及的内容填写备注信息。
- 重要程度：用整数表示，可选值为0（重要不紧急）、1（重要且紧急）、2（不重要不紧急）、3（不重要但紧急）。若不能判断，默认标记为0。

以下是一个示例json格式：
{
        "title": "示例事项",
        "start_time": "开始时间",
        "end_time":   "结束时间",
        "cycle": "day",
        "notes": "这是一个示例备注",
        "level": 0
}

`

// 每日励志语录prompt
export const dailyMotivationalQuotePrompt = `
你的任务是生成一条每日励志语句。该语句需要满足以下要求：
1. 语句风格阳光。
2. 语句内容简短。
3. 能够激励人心。
4. 控制在30字以内。
请直接返回生成的每日励志语句。
`
